notify/fon/short_code/6337/subscriptions/log.txt

6020782000004277--254724802834--MDSP2000009278--20190128094440--Addition--2019-01-28 12:44:47pm
6020782000004277--254723889462--MDSP2000009278--20190128110455--Addition--2019-01-28 02:05:05pm
6020782000004277--254721924607--MDSP2000009278--20190128110627--Addition--2019-01-28 02:06:33pm
6020782000004277--254723889462--MDSP2000009278--20190128111021--Deletion--2019-01-28 02:10:28pm

----------2019-01-28 03:10:02pm
<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:syncOrderRelation xmlns:ns1="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local"><ns1:userID><ID>254724802834</ID><type>0</type></ns1:userID><ns1:spID>602078</ns1:spID><ns1:productID>MDSP2000009278</ns1:productID><ns1:serviceID>6020782000004277</ns1:serviceID><ns1:serviceList>6020782000004277</ns1:serviceList><ns1:updateType>1</ns1:updateType><ns1:updateTime>20190128122421</ns1:updateTime><ns1:updateDesc>Addition</ns1:updateDesc><ns1:effectiveTime>20190128122421</ns1:effectiveTime><ns1:expiryTime>20370101000000</ns1:expiryTime><ns1:extensionInfo><item><key>accessCode</key><value>6337</value></item><item><key>chargeMode</key><value>0</value></item><item><key>MDSPSUBEXPMODE</key><value>1</value></item><item><key>objectType</key><value>1</value></item><item><key>isAutoExtend</key><value>0</value></item><item><key>shortCode</key><value>6337</value></item><item><key>isFreePeriod</key><value>false</value></item><item><key>payType</key><value>1</value></item><item><key>transactionID</key><value>240027101281008200843000005010</value></item><item><key>orderKey</key><value>999000000000014294</value></item><item><key>isSubscribeCnfmFlow</key><value>true</value></item><item><key>status</key><value>0</value></item><item><key>validTime</key><value>20370101000000</value></item><item><key>keyword</key><value>start</value></item><item><key>cycleEndTime</key><value>20190227210000</value></item><item><key>durationOfGracePeriod</key><value>-1</value></item><item><key>serviceAvailability</key><value>0</value></item><item><key>channelID</key><value>143</value></item><item><key>TraceUniqueID</key><value>240027101281008200843000005011</value></item><item><key>operCode</key><value></value></item><item><key>rentSuccess</key><value>true</value></item><item><key>try</key><value>false</value></item></ns1:extensionInfo></ns1:syncOrderRelation></soapenv:Body></soapenv:Envelope>
6020782000004277--254724802834--MDSP2000009278--20190128122421--Addition--2019-01-28 03:24:31pm
6020782000004277--254724802834--MDSP2000009278--20190128124024--Deletion--2019-01-28 03:40:34pm
6020782000004277--254723889462--MDSP2000009278--20190128133955--Addition--2019-01-28 04:40:02pm
6020782000004277--254724802834--MDSP2000009278--20190128190811--Addition--2019-01-28 10:08:17pm
6020782000004277--254723889462--MDSP2000009278--20190129060830--Deletion--2019-01-29 09:08:37am
6020782000004277--254723889462--MDSP2000009278--20190129065822--Addition--2019-01-29 09:58:29am
6020782000004277--254723889462--MDSP2000009278--20190129074907--Deletion--2019-01-29 10:49:13am
6020782000004277--254721924607--MDSP2000009278--20190905114644--Deletion--2019-09-05 12:40:09pm
